{
  "books": [
    {
      "id": 1,
      "title": "Harry Potter and the Philosopher's Stone",
      "released": "June 26, 1997",
      "pages": 223,
      "cover": "https://www.wizardingworld.com/images/products/books/UK/rectangle-1.jpg",
      "summary": "Harry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!",
      "rating": 4.47,
      "user_rating": 3
    },
    {
      "id": 2,
      "title": "Harry Potter and the Chamber of Secrets",
      "released": "July 2, 1998",
      "pages": 251,
      "cover": "https://www.wizardingworld.com/images/products/books/UK/rectangle-2.jpg",
      "summary": "Harry Potter's summer has included the worst birthday ever, doomy warnings from a house-elf called Dobby, and rescue from the Dursleys by his friend Ron Weasley in a magical flying car! Back at Hogwarts School of Witchcraft And Wizardry for his second year, Harry hears strange whispers echo through empty corridors – and then the attacks start. Students are found as though turned to stone... Dobby's sinister predictions seem to be coming true.",
      "rating": 4.43,
      "user_rating": 0
    },
    {
      "id": 3,
      "title": "Harry Potter and the Prisoner of Azkaban",
      "released": "July 8, 1999",
      "pages": 317,
      "cover": "https://www.wizardingworld.com/images/products/books/UK/rectangle-3.jpg",
      "summary": "When the Knight Bus crashes through the darkness and screeches to a halt in front of him, it's the start of another far from ordinary year at Hogwarts for Harry Potter. Sirius Black, escaped mass-murderer and follower of Lord Voldemort, is on the run – and they say he is coming after Harry. In his first ever Divination class, Professor Trelawney sees an omen of death in Harry's tea leaves... But perhaps most terrifying of all are the Dementors patrolling the school grounds, with their soul-sucking kiss.",
      "rating": 4.58,
      "user_rating": 0
    },
    {
      "id": 4,
      "title": "Harry Potter and the Goblet of Fire",
      "released": "July 8, 2000",
      "pages": 636,
      "cover": "https://www.wizardingworld.com/images/products/books/UK/rectangle-4.jpg",
      "summary": "The Triwizard Tournament is to be held at Hogwarts. Only wizards who are over seventeen are allowed to enter – but that doesn't stop Harry dreaming that he will win the competition. Then at Hallowe'en, when the Goblet of Fire makes its selection, Harry is amazed to find his name is one of those that the magical cup picks out. He will face death-defying tasks, dragons and Dark wizards, but with the help of his best friends, Ron and Hermione, he might just make it through – alive!",
      "rating": 4.56,
      "user_rating": 0
    },
    {
      "id": 5,
      "title": "Harry Potter and the Order of the Phoenix",
      "released": "June 21, 2003",
      "pages": 766,
      "cover": "https://www.wizardingworld.com/images/products/books/UK/rectangle-5.jpg",
      "summary": "Dark times have come to Hogwarts. After the Dementors' attack on his cousin Dudley, Harry Potter knows that Voldemort will stop at nothing to find him. There are many who deny the Dark Lord's return, but Harry is not alone: a secret Order gathers at Grimmauld Place to fight against the Dark forces. Harry must allow Professor Snape to teach him how to protect himself from Voldemort's savage assaults on his mind. But they are growing stronger by the day and Harry is running out of time.",
      "rating": 4.5,
      "user_rating": 0
    },
    {
      "id": 6,
      "title": "Harry Potter and the Half-Blood Prince",
      "released": "July 16, 2005",
      "pages": 607,
      "cover": "https://www.wizardingworld.com/images/products/books/UK/rectangle-6.jpg",
      "summary": "When Dumbledore arrives at Privet Drive one summer night to collect Harry Potter, his wand hand is blackened and shrivelled, but he does not reveal why. Secrets and suspicion are spreading through the wizarding world, and Hogwarts itself is not safe. Harry is convinced that Malfoy bears the Dark Mark: there is a Death Eater amongst them. Harry will need powerful magic and true friends as he explores Voldemort's darkest secrets, and Dumbledore prepares him to face his destiny.",
      "rating": 4.58,
      "user_rating": 0
    },
    {
      "id": 7,
      "title": "Harry Potter and the Deathly Hallows",
      "released": "July 7, 2007",
      "pages": 610,
      "cover": "https://www.wizardingworld.com/images/products/books/UK/rectangle-7.jpg",
      "summary": "As he climbs into the sidecar of Hagrid's motorbike and takes to the skies, leaving Privet Drive for the last time, Harry Potter knows that Lord Voldemort and the Death Eaters are not far behind. The protective charm that has kept Harry safe until now is broken, but he cannot keep hiding. The Dark Lord is breathing fear into everything Harry loves, and to stop him Harry will have to find and destroy the remaining Horcruxes. The final battle must begin – Harry must stand and face his enemy.",
      "rating": 4.62,
      "user_rating": 0
    }
  ],
  "reviews": [
    {
      "id": 1,
      "bookId": 1,
      "content": "I am OBSESSED with the magical world of Harry Potter, and I can’t wait to discover more about this world as the series continues!"
    },
    {
      "id": 2,
      "bookId": 2,
      "content": "Dobby brings so much chaos to this book. I love it! How do you get a house elf in real life?"
    },
    {
      "id": 3,
      "bookId": 3,
      "content": "So many twists and turns in the plot! Also, does anyone else think it’s super creepy that Pettigrew was sleeping in little boys’ beds for the last 12 years? Ick."
    },
    {
      "id": 4,
      "bookId": 4,
      "content": "THE BEST BOOK! We learn so much more about the world of magic outside of Hogwarts! Can we get a spin off series about Beauxbatons?? I want to know more!! Also, dragons!!!"
    },
    {
      "id": 5,
      "bookId": 5,
      "content": "I cried. A lot. The saddest book. I don’t think I can keep reading this series anymore. Too dark, too much heartbreak."
    },
    {
      "id": 6,
      "bookId": 6,
      "content": "I felt like this book was never going to end! I get that we needed all of this background info, but geez… it felt like such a chore reading this!"
    },
    {
      "id": 7,
      "bookId": 7,
      "content": "What a conclusion! There were definitely some parts that felt like they were moving a little slowly, but wow, there was still a lot of action! I feel like I can happily leave the wizarding world knowing all is well."
    },
    {
      "id": 8,
      "bookId": 1,
      "content": "The magical introduction to the wizarding world brims with wonder as Harry discovers his heritage and battles the forces of evil in a captivating adventure for all ages."
    },
    {
      "id": 9,
      "bookId": 2,
      "content": "Rowling continues to enchant readers with a darker mystery and deeper exploration of Hogwarts, intertwining humor and danger flawlessly."
    },
    {
      "id": 10,
      "bookId": 3,
      "content": "Delving into Harry's past, this installment presents a thrilling narrative filled with revelations, showcasing the complexity of good and evil in a world of wizardry."
    },
    {
      "id": 11,
      "bookId": 4,
      "content": "Rowling masterfully balances growing up and the encroaching darkness as the series takes a darker turn, plunging readers into a mesmerizing tale of danger and deceit."
    },
    {
      "id": 12,
      "bookId": 5,
      "content": "With themes of rebellion and loss, this book navigates Harry's tumultuous emotions while expanding the wizarding world's lore, setting the stage for an epic showdown."
    },
    {
      "id": 13,
      "bookId": 6,
      "content": "Unveiling secrets and exploring the complexities of characters, this installment intensifies the series' stakes, leading to heart-wrenching moments and unexpected alliances."
    },
    {
      "id": 14,
      "bookId": 7,
      "content": "Culminating in an epic battle between good and evil, this concluding book ties up loose ends while delivering an emotionally charged and satisfying conclusion to an iconic series."
    },
    {
      "bookId": 1,
      "content": "ye",
      "id": 15
    },
    {
      "bookId": 1,
      "content": "uh ",
      "id": 16
    }
  ],
  "curriculum": [
    [
      {
        "id": 1,
        "answer": "Incendio",
        "action": "conjures flames that can be used to set things on fire",
        "course": "Herbology"
      },
      {
        "id": 2,
        "answer": "Lumos",
        "action": "illuminates the tip of the caster's wand",
        "course": "Defense Against the Dark Arts"
      },
      {
        "id": 3,
        "answer": "Wingardium Leviosa",
        "action": "levitates an object",
        "course": "Charms"
      },
      {
        "id": 4,
        "answer": "Acusignis",
        "action": "transfigures a match into a needle",
        "course": "Transfiguration"
      }
    ],
    [
      {
        "id": 1,
        "answer": "Rictusempra",
        "action": "causes the target uncontrollable laughter",
        "course": "Charms"
      },
      {
        "id": 2,
        "answer": "Expelliarmus",
        "action": "forces an opponent's wand from their hand",
        "course": "Defense Against the Dark Arts"
      },
      {
        "id": 3,
        "answer": "Vera Verto",
        "action": "transfigures an animal into a goblet",
        "course": "Transfiguration"
      },
      {
        "id": 4,
        "answer": "Strengthening Solution",
        "action": "grants extreme strength",
        "course": "Potions"
      }
    ],
    [
      {
        "id": 1,
        "answer": "Exhilaro",
        "action": "makes your target feel elated. Warning: can be over overdone and cause fits of hysterical laughter",
        "course": "Charms"
      },
      {
        "id": 2,
        "answer": "Riddikulus",
        "action": "forces a Boggart to take a funny form, causing laughter and banishing the Boggart",
        "course": "Defense Against the Dark Arts"
      },
      {
        "id": 3,
        "answer": "Mimbulus Mimbletonia",
        "action": "produces Stinksap, which can be useful in caring for sick animals",
        "course": "Herbology"
      },
      {
        "id": 4,
        "answer": "Strigiforma",
        "action": "transfigures an owl into a pair of opera glasses",
        "course": "Transfiguration"
      }
    ],
    [
      {
        "id": 1,
        "answer": "Accio",
        "action": "summons a targeted object to the spell caster",
        "course": "Charms"
      },
      {
        "id": 2,
        "answer": "Reducto",
        "action": "blasts solid objects to pieces",
        "course": "Defense Against the Dark Arts"
      },
      {
        "id": 3,
        "answer": "Orchideous",
        "action": "conjures a bouquet of flowers from the caster's wand",
        "course": "Transfiguration"
      },
      {
        "id": 4,
        "answer": "Herbivicus",
        "action": "rapidly increases a plant's growth rate, causes flowers to bloom",
        "course": "Herbology"
      }
    ],
    [
      {
        "id": 1,
        "answer": "Silencio",
        "action": "renders the target temporary mute",
        "course": "Charms"
      },
      {
        "id": 2,
        "answer": "Evanesco",
        "action": "vanishes an object",
        "course": "Transfiguration"
      },
      {
        "id": 3,
        "answer": "Stupefy",
        "action": "stuns the target, leaving them unconscious",
        "course": "Defense Against the Dark Arts, unofficial curriculum"
      },
      {
        "id": 4,
        "answer": "Dittany",
        "action": "heals wounds by growing fresh skin over the injury",
        "course": "Herbology"
      }
    ],
    [
      {
        "id": 1,
        "answer": "Aguamenti",
        "action": "conjures a stream of drinkable water from the tip of the caster's wand",
        "course": "Charms"
      },
      {
        "id": 2,
        "answer": "Protego",
        "action": "protects the caster with an invisible shield that deflects both spells and objects",
        "course": "Defense Against the Dark Arts"
      },
      {
        "id": 3,
        "answer": "Crinus Muto",
        "action": "transforms the color or style of the caster's hair",
        "course": "Transfiguration"
      },
      {
        "id": 4,
        "answer": "Draught of Living Death",
        "action": "causes a deep sleep, similar to suspended animation",
        "course": "Potions"
      }
    ],
    [
      {
        "id": 1,
        "answer": "Impervius",
        "action": "makes an object repel moisture",
        "course": "Charms"
      },
      {
        "id": 2,
        "answer": "Veritaserum",
        "action": "forces the victim to answer all questions truthfully",
        "course": "Potions"
      },
      {
        "id": 3,
        "answer": "Bubotuber pus",
        "action": "cures even the worst cases of acne",
        "course": "Herbology, review"
      },
      {
        "id": 4,
        "answer": "Bombarda Maxima",
        "action": "causes a violent explosion",
        "course": "Defense Against the Dark Arts"
      }
    ]
  ]
}